"""
Создайте список предметов формата Название, препод, ваша любовь к предмету(от 0 до 10).
Сохраните в CSV файл(название файла - ваша фамилия).
P.S не менее 4 столбцов.
"""
import csv

data = [["Препод", "Название", "Любовь"],
        ["Вышмат", "Гомзяков", 11],
        ["Программирование", "Бабченок", 100],
        ["Сети", "Головин", 12],
        ["Микропроцессоры", "Торшин", 11]]
file = "college.csv"
with open(file, "w", newline = "") as f:
    writer = csv.writer(f)
    writer.writerows(data)
